Revit 2027 API
UIThemeManager.CurrentCanvasTheme Property
 current canvas theme.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static UITheme CurrentCanvasTheme { get; set; }
Public Shared Property CurrentCanvasTheme As UITheme
	Get
	Set
public:
static property UITheme CurrentCanvasTheme {
	UITheme get ();
	void set (UITheme value);
}
static member CurrentCanvasTheme : UITheme with get, set
Property Value
UITheme
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
UIThemeManager Class
Autodesk.Revit.UI Namespace